Revit 2026 API

# ModelTextModelTextType Property

---

The type for the model text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelTextType ModelTextType { get; set; }
```
```vb
Public Property ModelTextType As ModelTextType
	Get
	Set
```
```cpp
public:
property ModelTextType^ ModelTextType {
	ModelTextType^ get ();
	void set (ModelTextType^ value);
}
```
```fsharp
member ModelTextType : ModelTextType with get, set
```

#### Property Value

ModelTextType

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is assigned to this property. |

#### Reference

ModelText Class

Autodesk.Revit.DB Namespace